
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 35 to change, 4 to destroy.</code></pre>

* Update
  * azurerm_automation_account.automation_account
  * module.apim_product[0].azurerm_api_management_product.product
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_schedule.client_serects_trigger_once
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;auto-pip-stg-courtel-api&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;b2c-test-account-pwd&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;courtel-certificate&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;gov-uk-notify-api-key&#34;]
  * module.keyvault_ado_secrets.azurerm_key_vault_secret.secret[&#34;pip-team-email&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;apim-subscription-key&#34;]
  * module.keyvault_apim_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-HOST&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PASSWORD&#34;]
  * module.keyvault_redis_secrets.azurerm_key_vault_secret.secret[&#34;REDIS-PORT&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-java-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-insights-nodejs-instrumentation-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;app-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-ad-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-admin-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-auth-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-admin-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-config-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-extension-app-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-tenant-id&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-token-endpoint&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;b2c-url&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;cft-idam-client-secret&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;session-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-connection-string&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-key&#34;]
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;shared-storageaccount-name&#34;]
  * module.kv.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds
  * module.redis.azurerm_redis_cache.redis
* Replace
  * azurerm_key_vault_access_policy.app_mi_access_policy
  * azurerm_storage_blob.b2c_policy_files[&#34;reset-pw.css&#34;]
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects
  * module.automation_runbook_client_secret_rotation[&#34;apps&#34;].azurerm_automation_job_schedule.client_serects_trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_user_assigned_identity.apim_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "apim_mi"  {
      ~ client_id           = "b6248509-d791-4c33-a5ff-d65afd40809f" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-apim-stg-mi"
      ~ principal_id        = "89b6f7ac-e4d5-477c-970e-65d9e725b398" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # data.azurerm_user_assigned_identity.app_mi will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_user_assigned_identity" "app_mi"  {
      ~ client_id           = "8d0ead51-3b31-44df-a78e-ada4eea9fe87" -> (known after apply)
      ~ id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi" -> (known after apply)
      ~ location            = "uksouth" -> (known after apply)
        name                = "pip-stg-mi"
      ~ principal_id        = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ tags                = {
          - "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
          - "application"         = "publishing-information-service"
          - "businessArea"        = "Cross-Cutting"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#publishing-and-information"
          - "environment"         = "staging"
          - "managedBy"           = "Future Hearings - Publishing Information Project"
        } -> (known after apply)
      ~ tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa"
        name                          = "pip-ss-stg-aa"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (10 unchanged attributes hidden)


      ~ identity {
          ~ identity_ids = [
              - "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/managed-identities-ptl-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/jenkins-ptl-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-apim-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/pip-stg-mi",
            ] -> (known after apply)
            # (3 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_access_policy.app_mi_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply)
      ~ object_id               = "6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed" -> (known after apply) # forces replacement
      - storage_permissions     = [] -> null
        # (5 unchanged attributes hidden)
    }

  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] must be replaced
-/+ resource "azurerm_storage_blob" "b2c_policy_files" {
      ~ access_tier            = "Cool" -> (known after apply)
      - content_md5            = "31657fe2e4bc0c44222401b890d2eae5" -> null # forces replacement
      ~ id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css" -> (known after apply)
      ~ metadata               = {} -> (known after apply)
        name                   = "reset-pw.css"
      ~ source_content         = <<-EOT # forces replacement
            @charset "UTF-8";
            .govspeak p {
              color: #0b0c0c;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-family: "GDS Transport", arial, sans-serif;
              font-size: 19px;
              line-height: 1.3157894737;
              margin-top: 20px;
              margin-bottom: 20px;
            }
            
            .govspeak ul {
              list-style-position: outside;
              list-style-type: disc;
            }
            
            .govspeak li {
              margin: 0 0 5px;
              padding: 0;
              font-size: 19px;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              color: #0b0c0c;
            }
            
            .gem-c-document-list__item {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-size: 19px;
              line-height: 1.3157894737;
              margin-bottom: 25px;
              padding-top: 10px;
              border-top: 1px solid #b1b4b6;
              list-style: none;
            }
            
            .gem-c-contents-list__list-item--dashed {
              position: relative;
              padding-left: 25px;
              padding-right: 25px;
              padding-top: 7.5px;
              line-height: 1.3;
              list-style-type: none;
              font-size: 16px;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
            }
            
            .gem-c-contents-list__list-item--dashed::before {
              content: "—";
              position: absolute;
              left: 0;
              width: 20px;
              overflow: hidden;
            }
            
            .gem-c-contents-list__title {
              font-size: 16px;
              line-height: 1.5;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
            }
            
            .gem-c-lead-paragraph {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              margin-top: 0;
              -moz-osx-font-smoothing: grayscale;
              font-size: 24px;
              line-height: 1.25;
              margin-bottom: 40px;
              max-width: 30em;
            }
            
            .metadata-logo-wrapper {
              border-top: 1px solid #b1b4b6;
              margin-left: 15px;
              margin-right: 15px;
              content: "";
              clear: both;
              display: block;
              box-sizing: border-box;
              width: 100%;
            }
            
            .govuk-grid-column-two-thirds {
              width: 66.6666%;
              float: left;
            }
            
            .gem-c-metadata {
              margin-right: -15px;
              margin-left: -15px;
              margin-bottom: 40px;
              line-height: 1.25;
              font-family: "GDS Transport", arial, sans-serif;
              font-size: 16px;
              font-weight: 400;
              color: #0b0c0c;
              -moz-osx-font-smoothing: grayscale;
              float: left;
              width: 66.66%;
            }
            
            .group-title {
              margin-top: 50px;
              margin-bottom: 20px;
              font-size: 27px;
              line-height: 1.1111111;
              font-weight: 700;
              font-family: "GDS Transport", arial, sans-serif;
              -moz-osx-font-smoothing: grayscale;
            }
            
            .app-c-published-dates {
              padding-top: 10px;
              border-top: 1px solid #b1b4b6;
              direction: ltr;
              line-height: 1.45em;
              color: #0b0c0c;
            }
            
            .gem-c-related-navigation__sub-heading {
              font-size: 19px;
              line-height: 1.3157894737;
              font-family: "GDS Transport", arial, sans-serif;
              border-top: 0;
              padding-top: 0;
              margin-top: 15px;
              margin-bottom: 10px;
              color: #0b0c0c;
              font-weight: 700;
            }
            
            .gem-c-related-navigation__link {
              line-height: 1.28;
              font-size: 16px;
              font-family: "GDS Transport", arial, sans-serif;
              font-weight: 400;
              margin-top: 15px;
            }
            
            .gem-c-related-navigation {
              border-top: 2px solid #1d70b8;
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              text-decoration-skip-ink: none;
            }
            
            .gem-c-related-navigation__link-list {
              font-family: "GDS Transport", arial, sans-serif;
              color: #003078;
              margin-bottom: 1.25em;
              font-weight: bold;
              font-size: 16px;
              list-style-type: none;
              text-decoration: underline;
              text-underline-offset: .1em;
            }
            
            .gem-c-related-navigation__main-heading {
              font-size: 19px;
              font-family: "GDS Transport", arial, sans-serif;
              line-height: 1.31578;
              -moz-osx-font-smoothing: grayscale;
              margin-top: 15px;
              margin-bottom: 10px;
              color: #0b0c0c;
            }
            
            @charset "UTF-8";
            .govuk-link {
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              text-decoration: underline;
            }
            
            /*! Copyright (c) 2011 by Margaret Calvert & Henrik Kubel. All rights reserved. The font has been customised for exclusive use on gov.uk. This cut is not commercially available. */
            /* stylelint-disable-line scss/comment-no-loud  */
            @font-face {
              font-family: "GDS Transport";
              font-style: normal;
              font-weight: normal;
              src: url("/assets/fonts/light-94a07e06a1-v2.woff2") format("woff2"), url("/assets/fonts/light-f591b13f7d-v2.woff") format("woff");
              font-display: fallback;
            }
            
            @font-face {
              font-family: "GDS Transport";
              font-style: normal;
              font-weight: bold;
              src: url("/assets/fonts/bold-b542beb274-v2.woff2") format("woff2"), url("/assets/fonts/bold-affa96571d-v2.woff") format("woff");
              font-display: fallback;
            }
            
            @media print {
              .govuk-link {
                font-family: sans-serif;
              }
            }
            
            .govuk-link:focus {
              outline: 3px solid transparent;
              color: #0b0c0c;
              background-color: #ffdd00;
              box-shadow: 0 -2px #ffdd00, 0 4px #0b0c0c;
              text-decoration: none;
            }
            
            .govuk-link:link {
              color: #1d70b8;
            }
            
            .govuk-link:visited {
              color: #4c2c92;
            }
            
            .govuk-link:hover {
              color: #003078;
            }
            
            .govuk-link:active {
              color: #0b0c0c;
            }
            
            .govuk-link:focus {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link[href^="/"]:after, .govuk-link[href^="http://"]:after, .govuk-link[href^="https://"]:after {
                content: " (" attr(href) ")";
                font-size: 90%;
                word-wrap: break-word;
              }
            }
            
            .govuk-link--muted:link, .govuk-link--muted:visited {
              color: #505a5f;
            }
            
            .govuk-link--muted:hover, .govuk-link--muted:active {
              color: #0b0c0c;
            }
            
            .govuk-link--muted:focus {
              color: #0b0c0c;
            }
            
            .govuk-link--text-colour:link, .govuk-link--text-colour:visited {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link--text-colour:link, .govuk-link--text-colour:visited {
                color: #000000;
              }
            }
            
            .govuk-link--text-colour:hover {
              color: rgba(11, 12, 12, 0.99);
            }
            
            .govuk-link--text-colour:active, .govuk-link--text-colour:focus {
              color: #0b0c0c;
            }
            
            @media print {
              .govuk-link--text-colour:active, .govuk-link--text-colour:focus {
                color: #000000;
              }
            }
            
            .govuk-link--inverse:link, .govuk-link--inverse:visited {
              color: #ffffff;
            }
            
            .govuk-link--inverse:hover, .govuk-link--inverse:active {
              color: rgba(255, 255, 255, 0.99);
            }
            
            .govuk-link--inverse:focus {
              color: #0b0c0c;
            }
            
            .govuk-link--no-underline:not(:hover):not(:active) {
              text-decoration: none;
            }
            
            .govuk-link--no-visited-state:link {
              color: #1d70b8;
            }
            
            .govuk-link--no-visited-state:visited {
              color: #1d70b8;
            }
            
            .govuk-link--no-visited-state:hover {
              color: #003078;
            }
            
            .govuk-link--no-visited-state:active {
              color: #0b0c0c;
            }
            
            .govuk-link--no-visited-state:focus {
              color: #0b0c0c;
            }
            
            .govuk-list {
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 400;
              font-size: 16px;
              font-size: 1rem;
              line-height: 1.25;
              color: #0b0c0c;
              margin-top: 0;
              margin-bottom: 15px;
              padding-left: 0;
              list-style-type: none;
            }
            
            @media print {
              .govuk-list {
                font-family: sans-serif;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list {
                font-size: 19px;
                font-size: 1.1875rem;
                line-height: 1.31579;
              }
            }
            
            @media print {
              .govuk-list {
                font-size: 14pt;
                line-height: 1.15;
              }
            }
            
            @media print {
              .govuk-list {
                color: #000000;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list {
                margin-bottom: 20px;
              }
            }
            
            .govuk-list .govuk-list {
              margin-top: 10px;
            }
            
            .govuk-list > li {
              margin-bottom: 5px;
            }
            
            .govuk-list--bullet {
              padding-left: 20px;
              list-style-type: disc;
            }
            
            .govuk-list--number {
              padding-left: 20px;
              list-style-type: decimal;
            }
            
            .govuk-list--bullet > li,
            .govuk-list--number > li {
              margin-bottom: 0;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list--bullet > li,
              .govuk-list--number > li {
                margin-bottom: 5px;
              }
            }
            
            .govuk-list--spaced > li {
              margin-bottom: 10px;
            }
            
            @media (min-width: 40.0625em) {
              .govuk-list--spaced > li {
                margin-bottom: 15px;
              }
            }
            
            .govuk-template {
              background-color: #f3f2f1;
              -webkit-text-size-adjust: 100%;
              -ms-text-size-adjust: 100%;
              text-size-adjust: 100%;
            }
            
            @media screen {
              .govuk-template {
                overflow-y: scroll;
              }
            }
            
            .govuk-template__body {
              margin: 0;
              background-color: #ffffff;
            }
            
            .govuk-heading-xl {
              color: #0b0c0c;
              font-family: "GDS Transport", arial, sans-serif;
              -webkit-font-smoothing: antialiased;
              -moz-osx-font-smoothing: grayscale;
              font-weight: 700;
              font-size: 32px;
              font-size: 2rem;
              line-height: 1.09375;
              display: block;
              margin-top: 0;
              margin-bottom: 30px;
            }
            
            @media print {
              .govuk-heading-xl {
                color: #000000;
              }
            }
            
            @media print {
              .govuk-heading-xl {
                font-family: sans-serif;
              }
            }
            
            @media (min-width: 40.0625em) {
              .govuk-heading-xl {
                font-size: 48px;
                font-size: 3rem;
                line-height: 1.04167;
              }
            }
            
            @media print {
              .govuk-heading-xl {
     

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

dejs-instrumentation-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "App Insights"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["app-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/app-tenant-id/6e75884757794cc5b6739353b7f0499a"
        name                    = "app-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-ad-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-ad-url/393424f8773241fe98a1be70736818b9"
        name                    = "b2c-ad-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-admin-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-admin-url/8e6dde85b50a4d16853643cdcf299ff3"
        name                    = "b2c-admin-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-auth-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-auth-endpoint/5a11d3a5a21f4285962e13216c4bb605"
        name                    = "b2c-auth-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-admin-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-admin-endpoint/51386e906269465da6b4663bbc76a227"
        name                    = "b2c-config-admin-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-config-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-config-endpoint/4b8816cc89174ea5a5340362d401419e"
        name                    = "b2c-config-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-extension-app-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-extension-app-id/1f338cfb15a44dde8c9edceaf00405ae"
        name                    = "b2c-extension-app-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-tenant-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-tenant-id/0a88f286fefb4ecdb9134a323b7a55bc"
        name                    = "b2c-tenant-id"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-token-endpoint"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-token-endpoint/6bdeecbdd6e3403090cc949f5c72d9b4"
        name                    = "b2c-token-endpoint"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["b2c-url"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/b2c-url/13887feb82b94246a9343877dacb52d6"
        name                    = "b2c-url"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "source"              = "Azure b2c Tenant 676640dc-dc08-45b7-b6d6-f74f30fb94e3"
        }
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["cft-idam-client-secret"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/cft-idam-client-secret/76d5fa70c6da4ffba3f4830dada411d7"
        name                    = "cft-idam-client-secret"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["session-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/session-key/87a32fee4d2640c087c224a85291a2fd"
        name                    = "session-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
            "purpose"             = "b2c-session"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-connection-string"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-connection-string/f4c0b02ffdf84eeeb6ea24e78f2f40a4"
        name                    = "shared-storageaccount-connection-string"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-key"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-key/2a694c11a4814948bf6f093be1a08933"
        name                    = "shared-storageaccount-key"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (7 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["shared-storageaccount-name"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
      ~ expiration_date         = "2023-03-01T01:00:00Z" -> (known after apply)
        id                      = "https://pip-ss-kv-stg.vault.azure.net/secrets/shared-storageaccount-name/c47855dfbfdf4acbb028628fc6cd6cd5"
        name                    = "shared-storageaccount-name"
        tags                    = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (6 unchanged attributes hidden)
    }

  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AzurePolicyEvaluationDetails" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-cache-stg/providers/Microsoft.Cache/Redis/pip-stg"
        name                          = "pip-stg"
        tags                          = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (23 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved = 642 -> 300
          ~ maxmemory_delta                 = 642 -> 200
          ~ maxmemory_reserved              = 642 -> 200
            # (7 unchanged attributes hidden)
        }
    }

Plan: 4 to add, 35 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_key_vault_access_policy.app_mi_access_policy has been changed
  ~ resource "azurerm_key_vault_access_policy" "app_mi_access_policy" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg/objectId/6a64b0e0-13eb-4f0c-b9a9-f88ae1928fed"
      + storage_permissions     = []
        # (6 unchanged attributes hidden)
    }
  # azurerm_storage_blob.b2c_policy_files["reset-pw.css"] has been changed
  ~ resource "azurerm_storage_blob" "b2c_policy_files" {
      + content_md5            = "31657fe2e4bc0c44222401b890d2eae5"
        id                     = "https://pipsssastg.blob.core.windows.net/b2c-custom-policy-files/reset-pw.css"
        name                   = "reset-pw.css"
        # (10 unchanged attributes hidden)
    }
  # azuread_application.frontend_apps["frontend"] has been changed
  ~ resource "azuread_application" "frontend_apps" {
        id                             = "230bec9c-3991-4499-abe3-e58276a7dd99"
        tags                           = []
        # (15 unchanged attributes hidden)







      ~ web {
          ~ redirect_uris = [
              - "https://pip-frontend-pr-559.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-559.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-560.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-560.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-561.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-561.dev.platform.hmcts.net/login/return",
              - "https://pip-frontend-pr-562.dev.platform.hmcts.net/login/admin/return",
              - "https://pip-frontend-pr-562.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-563.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-563.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-564.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-564.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-565.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-565.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-567.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-567.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-568.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-568.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-569.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-569.dev.platform.hmcts.net/login/return",
              + "https://pip-frontend-pr-570.dev.platform.hmcts.net/login/admin/return",
              + "https://pip-frontend-pr-570.dev.platform.hmcts.net/login/return",
                # (53 unchanged elements hidden)
            ]
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
        # (6 unchanged blocks hidden)
    }
  # module.kv.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-kv-stg|pip-ss-kv-stg"
        name                       = "pip-ss-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # module.kv_apim.azurerm_monitor_diagnostic_setting.kv-ds has been changed
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                         = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.KeyVault/vaults/pip-ss-apim-kv-stg|pip-ss-apim-kv-stg"
        name                       = "pip-ss-apim-kv-stg"
        # (2 unchanged attributes hidden)

      + log {
          + category = "AuditEvent"
          + enabled  = true

          + retention_policy {
              + days    = 14
              + enabled = true
            }
        }
      - log {
          - category = "AuditEvent" -> null
          - enabled  = true -> null

          - retention_policy {
              - days    = 14 -> null
              - enabled = true -> null
            }
        }
      + log {
          + category = "AzurePolicyEvaluationDetails"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = false

          + retention_policy {
              + days    = 0
              + enabled = false
            }
        }
    }
  # module.automation_runbook_client_secret_rotation["apps"].azurerm_automation_runbook.client_serects has been changed
  ~ resource "azurerm_automation_runbook" "client_serects" {
        id                       = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/pip-ss-stg-rg/providers/Microsoft.Automation/automationAccounts/pip-ss-stg-aa/runbooks/secret-rotation-b2c-apps"
      ~ job_schedule             = [
          - {
              - job_schedule_id = "00c29dbc-bfda-4552-876a-c88ec7c993ee"
              - parameters      = {}
              - run_on          = ""
              - schedule_name   = "rotate-client-secrets-schedule"
            },
          + {
              + job_schedule_id = "72d84742-cb2d-4db4-898d-753de3e36a0b"
              + parameters      = {}
              + run_on          = ""
              + schedule_name   = "rotate-client-secrets-schedule"
            },
        ]
        name                     = "secret-rotation-b2c-apps"
        tags                     = {
            "BuiltFrom"           = "https://github.com/HMCTS/pip-shared-infrastructures.git"
            "application"         = "publishing-information-service"
            "businessArea"        = "Cross-Cutting"
            "changeUrl"           = ""
            "contactSlackChannel" = "#publishing-and-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Publishing Information Project"
        }
        # (9 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":77,"Program":"tfcmt","SHA1":"","Vars":{}} -->